package ru.numerals

/**
 * Date: 9/13/12
 * Time: 6:37 PM
 */

object RuStrings {
  val digitsM = List (
    List ("",         "десять ",        "",             ""),
    List ("один ",    "одиннадцать ",   "десять ",      "сто "),
    List ("два ",     "двенадцать ",    "двадцать ",    "двести "),
    List ("три ",     "тринадцать ",    "тридцать ",    "триста "),
    List ("четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
    List ("пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
    List ("шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
    List ("семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
    List ("восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
    List ("девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  )


  val digitsF = List (
    List ("",         "десять ",        "",             ""),
    List ("одна ",    "одиннадцать ",   "десять ",      "сто "),
    List ("две ",     "двенадцать ",    "двадцать ",    "двести "),
    List ("три ",     "тринадцать ",    "тридцать ",    "триста "),
    List ("четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
    List ("пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
    List ("шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
    List ("семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
    List ("восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
    List ("девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  )


  val digitsN = List (
    List ("",         "десять ",        "",             ""),
    List ("одно ",    "одиннадцать ",   "десять ",      "сто "),
    List ("два ",     "двенадцать ",    "двадцать ",    "двести "),
    List ("три ",     "тринадцать ",    "тридцать ",    "триста "),
    List ("четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
    List ("пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
    List ("шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
    List ("семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
    List ("восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
    List ("девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  )
}
