package ru.numerals

/**
 * Created with IntelliJ IDEA.
 * Date: 9/13/12
 * Time: 6:37 PM
 */

object ruStrings {
  val digitsNSM = List (
    List ("",         "десять ",        "",             ""),
    List ("один ",    "одиннадцать ",   "десять ",      "сто "),
    List ("два ",     "двенадцать ",    "двадцать ",    "двести "),
    List ("три ",     "тринадцать ",    "тридцать ",    "триста "),
    List ("четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
    List ("пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
    List ("шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
    List ("семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
    List ("восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
    List ("девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  )


  val digitsNSF = List (
    List ("",         "десять ",        "",             ""),
    List ("одна ",    "одиннадцать ",   "десять ",      "сто "),
    List ("две ",     "двенадцать ",    "двадцать ",    "двести "),
    List ("три ",     "тринадцать ",    "тридцать ",    "триста "),
    List ("четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
    List ("пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
    List ("шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
    List ("семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
    List ("восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
    List ("девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  )


  val digitsNSN = List (
    List ("",         "десять ",        "",             ""),
    List ("одно ",    "одиннадцать ",   "десять ",      "сто "),
    List ("два ",     "двенадцать ",    "двадцать ",    "двести "),
    List ("три ",     "тринадцать ",    "тридцать ",    "триста "),
    List ("четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
    List ("пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
    List ("шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
    List ("семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
    List ("восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
    List ("девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  )



  //  private val digits = List (
  //    List ("",         "",         "",         "десять ",        "",             ""),
  //    List ("один ",    "одна ",    "одно ",    "одиннадцать ",   "десять ",      "сто "),
  //    List ("два ",     "две ",     "два ",     "двенадцать ",    "двадцать ",    "двести "),
  //    List ("три ",     "три ",     "три ",     "тринадцать ",    "тридцать ",    "триста "),
  //    List ("четыре ",  "четыре ",  "четыре ",  "четырнадцать ",  "сорок ",       "четыреста "),
  //    List ("пять ",    "пять ",    "пять ",    "пятнадцать ",    "пятьдесят ",   "пятьсот "),
  //    List ("шесть ",   "шесть ",   "шесть ",   "шестнадцать ",   "шестьдесят ",  "шестьсот "),
  //    List ("семь ",    "семь ",    "семь ",    "семнадцать ",    "семьдесят ",   "семьсот "),
  //    List ("восемь ",  "восемь ",  "восемь ",  "восемнадцать ",  "восемьдесят ", "восемьсот "),
  //    List ("девять ",  "девять ",  "девять ",  "девятнадцать ",  "девяносто ",   "девятьсот ")
  //  )

  val digitsASM = List (
    List ("",           "десятый ",      "",               ""),
    List ("первый ",    "одиннадцатый ",  "десятый ",       "сотый "),
    List ("второй ",    "двенадцатый ",   "двадцатый ",     "двухсотый "),
    List ("третий ",    "тринадцатый ",   "тридцатый ",     "трехсотый "),
    List ("четвертый ", "четырнадцатый ", "сороковой ",     "четырсотый "),
    List ("пятый ",     "пятнадцатый ",   "пятьдесятый ",   "пятисотый "),
    List ("шестой ",    "шестнадцатый ",  "шестьдесятый ",  "шестисотый "),
    List ("седьмой ",   "семнадцатый ",   "семьдесятый ",   "семисотый "),
    List ("восьмой ",   "восемнадцатый ", "восемьдесятый ", "восемисотый "),
    List ("девятый ",   "девятнадцатый ", "девяностый ",    "девятисотый ")
  )



  val digitsASF = List (
    List ("",           "десятая ",       "",               ""),
    List ("первая ",    "одиннадцатая ",  "десятая ",       "сотая "),
    List ("вторая ",    "двенадцатая ",   "двадцатая ",     "двухсотая "),
    List ("третья ",    "тринадцатая ",   "тридцатая ",     "трехсотая "),
    List ("четвертая ", "четырнадцатая ", "сороковая ",     "четырехсотая "),
    List ("пятая ",     "пятнадцатая ",   "пятидесятая ",   "пятисотая "),
    List ("шестая ",    "шестнадцатая ",  "шестидесятая ",  "шестисотая "),
    List ("седьмая ",   "семнадцатая ",   "семидесятая ",   "семисотая "),
    List ("восьмая ",   "восемнадцатая ", "восемидесятая ", "восьмисотая "),
    List ("девятая ",   "девятнадцатая ", "девяностая ",    "девятисотая ")
  )


  val digitsAPF = List (
    List ("",           "десятых ",       "",               ""),
    List ("первых ",    "одиннадцатых ",  "десятых ",       "сотых "),
    List ("вторых ",    "двенадцатых ",   "двадцатых ",     "двухсотых "),
    List ("третьих ",   "тринадцатых ",   "тридцатых ",     "трехсотых "),
    List ("четвертых ", "четырнадцатых ", "сороковых ",     "четырехсотых "),
    List ("пятых ",     "пятнадцатых ",   "пятидесятых ",   "пятисотых "),
    List ("шестых ",    "шестнадцатых ",  "шестидесятых ",  "шестисотых "),
    List ("седьмых ",   "семнадцатых ",   "семидесятых ",   "семисотых "),
    List ("восьмых ",   "восемнадцатых ", "восемидесятых ", "восьмисотых "),
    List ("девятых ",   "девятнадцатых ", "девяностых ",    "девятисотых ")
  )


  val digitsASN = List (
    List ("",           "десятое ",        "",             ""),
    List ("первое ",    "одиннадцатое ",   "десятое ",      "сто "),
    List ("второе ",    "двенадцатое ",    "двадцатое ",    "двести "),
    List ("третье ",    "тринадцатое ",    "тридцатое ",    "триста "),
    List ("четвертое ", "четырнадцатое ",  "сороковое ",       "четыреста "),
    List ("пятое ",     "пятнадцатое ",    "пятидесятое ",   "пятьсот "),
    List ("шестое ",    "шестнадцатое ",   "шестидесятое ",  "шестьсот "),
    List ("седьмое ",   "семнадцатое ",    "семидесятое ",   "семьсот "),
    List ("восьмое ",   "восемнадцатое ",  "восемидесятое ", "восемьсот "),
    List ("девятое ",   "девятнадцатое ",  "девяностоое ",   "девятьсот ")
  )
}
